case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 503.15;

boundaryField
{
    in
    {
         type            fixedValue;
         value           uniform 503.15;
    }

    "(es|is).*"
    {
        type            zeroGradient;        
    }

     "(wall).*"
    {
        type            fixedValue;
        value           uniform 503.15;
    }

}

// ************************************************************************* //
