case/Allrun_code
#!/bin/sh
cd ${0%/*} || exit 1   

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

#-- Run on single processor
runApplication `getApplication`

#------------------------------------------------------------------------------
